app/controllers/comments_controller.rb

INSERT INTO "comments" ("author", "body", "created_at", "fortune_id", "updated_at") VALUES ('sdfghj', 'qwertyu', '2010-10-25 11:18:01.189365', 5, '2010-10-25 11:18:01.189365')
---
  def create
    @comment = @fortune.comments.new params[:comment]
    @comment.save

SELECT "comments".* FROM "comments" WHERE ("comments".fortune_id = 26) AND ("comments"."id" = 2) LIMIT 1
DELETE FROM "comments" WHERE ("comments"."id" = 2)
---
  def destroy
    @comment = @fortune.comments.find params[:id]
    @comment.destroy