app/controllers/fortunes_controller.rb

def index
  @fortunes = Fortune.search(params[:search], params[:page])
---
SELECT "fortunes".* FROM "fortunes" WHERE (body like '%%') ORDER BY updated_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) AS count_id FROM (SELECT 1 FROM "fortunes" WHERE (body like '%%')) AS subquery

	def tags
  	@fortunes = Fortune.tagged_with(params[:name])
  	@fortunes = @fortunes.paginate :per_page => 5, :page => params[:page], :order => 'created_at desc'
---
SELECT "fortunes".* FROM "fortunes" JOIN taggings fortunes_taggings_Shakespeare_790 ON fortunes_taggings_Shakespeare_790.taggable_id = fortunes.id AND fortunes_taggings_Shakespeare_790.taggable_type = 'Fortune' AND fortunes_taggings_Shakespeare_790.tag_id = 6 ORDER BY updated_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) AS count_id FROM "fortunes" JOIN taggings fortunes_taggings_IRC_367 ON fortunes_taggings_IRC_367.taggable_id = fortunes.id AND fortunes_taggings_IRC_367.taggable_type = 'Fortune' AND fortunes_taggings_IRC_367.tag_id = 6
SELECT tags.*, COUNT(*) AS count FROM "tags" LEFT OUTER JOIN taggings ON tags.id = taggings.tag_id AND taggings.context = 'tags' INNER JOIN fortunes ON fortunes.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Fortune') AND (taggings.taggable_id IN(SELECT fortunes.id FROM "fortunes")) GROUP BY tags.id, tags.name HAVING COUNT(*) > 0

  def show
  @fortune = Fortune.find(params[:id])
---
SELECT "fortunes".* FROM "fortunes" WHERE ("fortunes"."id" = 3) LIMIT 1

  def edit
    @fortune = Fortune.find(params[:id])
---
SELECT "fortunes".* FROM "fortunes" WHERE ("fortunes"."id" = 26) LIMIT 1

  def create
    @fortune = Fortune.new(params[:fortune])
    @fortune.save
---
INSERT INTO "fortunes" ("body", "created_at", "updated_at") VALUES ('Kiedy jesteś zakochany, wszystko zaczynasz widzieć w nowym świetle; stajesz się hojny, przebaczający i miły w sytuacjach, w których wcześniej bywałeś twardy i podły. W sposób nieunikniony ludzie zaczną podobnie reagować i wkrótce przekonasz się, iż żyjesz w świecie ogarniętym miłością, który ty sam stworzyłeś. Albo przypomnij sobie okresy, kiedy byłeś w złym humorze i jak wszystko cię denerwowało, stawałeś się podejrzliwy, podły i wręcz paranoidalny. Widziałeś, jak inni ludzie reagowali na twoje zachowanie w podobnie negatywny sposób, i nagle zdałeś sobie sprawę, że żyjesz we wrogim świecie stworzonym przez twoje myśli i twoje uczucia.

  def update
    @fortune = Fortune.find(params[:id])
---
SELECT "fortunes".* FROM "fortunes" WHERE ("fortunes"."id" = 26) LIMIT 1

  def destroy
    @fortune = Fortune.find(params[:id])
    @fortune.destroy
---
SELECT "fortunes".* FROM "fortunes" WHERE ("fortunes"."id" = 4) LIMIT 1
DELETE FROM "fortunes" WHERE ("fortunes"."id" = 4)